---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotRotateLocked
source: html/2ce53d2f-d4b3-f7cf-914d-9a6ecfd612c3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotRotateLocked Property

Can't rotate pinned element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRotateLocked { get; }
```